Revit 2027 API
SpatialElementGeometryResults Methods
The SpatialElementGeometryResults type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundaryFaceInfo |  Query the spatial element boundary face information with the given face.
GetGeometry |  The solid from the spatial element.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace